
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если ПорогПримененияСкидки.Количество() < 1 Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'Пороги применения скидки должны быть заполнены'", "ru"); 
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	
	// регистр dz_ДействующиеСкидки
	Движения.dz_ДействующиеСкидки.Записывать = Истина;
	Движение = Движения.dz_ДействующиеСкидки.Добавить();
	Движение.Период = ПериодДействияНачало;
	Движение.Скидка = Скидка;
	Движение.Действует = Истина;
	Движение.СрокДействияСкидки = ПериодДействияКонец;

	// регистр dz_ПорогиРасчетаСкидки
	Движения.dz_ПорогиРасчетаСкидки.Записывать = Истина;
	Для Каждого ТекСтрокаПорогПримененияСкидки Из ПорогПримененияСкидки Цикл
		Движение = Движения.dz_ПорогиРасчетаСкидки.Добавить();
		Движение.Период = ПериодДействияНачало;
		Движение.Скидка = Скидка;
		Движение.ПорогПрименения = ТекСтрокаПорогПримененияСкидки.НижняяГраницаПорога;
		Движение.ЗначениеСкидки = ТекСтрокаПорогПримененияСкидки.ЗначениеСкидки;
	КонецЦикла;

КонецПроцедуры
